theoliver7/hslu-pren2-team1/stair-climber-tinyK22/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t GROUND_SENSOR_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA13 (pin 29)  */
    GPIO_PinInit(BOARD_INITPINS_GROUND_SENSOR_GPIO, BOARD_INITPINS_GROUND_SENSOR_PIN, &GROUND_SENSOR_config);

    gpio_pin_config_t ULTRA_SONIC1_SEND_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB0 (pin 35)  */
    GPIO_PinInit(BOARD_INITPINS_ULTRA_SONIC1_SEND_GPIO, BOARD_INITPINS_ULTRA_SONIC1_SEND_PIN, &ULTRA_SONIC1_SEND_config);

    gpio_pin_config_t ULTRA_SONIC2_SEND_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB1 (pin 36)  */
    GPIO_PinInit(BOARD_INITPINS_ULTRA_SONIC2_SEND_GPIO, BOARD_INITPINS_ULTRA_SONIC2_SEND_PIN, &ULTRA_SONIC2_SEND_config);

    gpio_pin_config_t STEPMOT_RESET_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB2 (pin 37)  */
    GPIO_PinInit(BOARD_INITPINS_STEPMOT_RESET_GPIO, BOARD_INITPINS_STEPMOT_RESET_PIN, &STEPMOT_RESET_config);

    gpio_pin_config_t STEPMOT_MS2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB3 (pin 38)  */
    GPIO_PinInit(BOARD_INITPINS_STEPMOT_MS2_GPIO, BOARD_INITPINS_STEPMOT_MS2_PIN, &STEPMOT_MS2_config);

    gpio_pin_config_t STEPMOT_MS1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB16 (pin 39)  */
    GPIO_PinInit(BOARD_INITPINS_STEPMOT_MS1_GPIO, BOARD_INITPINS_STEPMOT_MS1_PIN, &STEPMOT_MS1_config);

    gpio_pin_config_t STEPMOT_MS0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB17 (pin 40)  */
    GPIO_PinInit(BOARD_INITPINS_STEPMOT_MS0_GPIO, BOARD_INITPINS_STEPMOT_MS0_PIN, &STEPMOT_MS0_config);

    gpio_pin_config_t STEPMOT_EN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB18 (pin 41)  */
    GPIO_PinInit(BOARD_INITPINS_STEPMOT_EN_GPIO, BOARD_INITPINS_STEPMOT_EN_PIN, &STEPMOT_EN_config);

    gpio_pin_config_t STEPMOT_DIR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC8 (pin 53)  */
    GPIO_PinInit(BOARD_INITPINS_STEPMOT_DIR_GPIO, BOARD_INITPINS_STEPMOT_DIR_PIN, &STEPMOT_DIR_config);

    gpio_pin_config_t LEDBARRIER_RIGHT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD7 (pin 64)  */
    GPIO_PinInit(BOARD_INITPINS_LEDBARRIER_RIGHT_GPIO, BOARD_INITPINS_LEDBARRIER_RIGHT_PIN, &LEDBARRIER_RIGHT_config);

    gpio_pin_config_t LEDBARRIER_LEFT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE0 (pin 1)  */
    GPIO_PinInit(BOARD_INITPINS_LEDBARRIER_LEFT_GPIO, BOARD_INITPINS_LEDBARRIER_LEFT_PIN, &LEDBARRIER_LEFT_config);

    gpio_pin_config_t LEDBARRIER_STEPPER_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE1 (pin 2)  */
    GPIO_PinInit(BOARD_INITPINS_LEDBARRIER_STEPPER_GPIO, BOARD_INITPINS_LEDBARRIER_STEPPER_PIN, &LEDBARRIER_STEPPER_config);

    /* PORTA1 (pin 23) is configured as FTM0_CH6 */
    PORT_SetPinMux(BOARD_INITPINS_LIFTMOT2_UP_PORT, BOARD_INITPINS_LIFTMOT2_UP_PIN, kPORT_MuxAlt3);

    PORTA->PCR[1] = ((PORTA->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullDown)

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTA12 (pin 28) is configured as FTM1_CH0 */
    PORT_SetPinMux(BOARD_INITPINS_ULTRA_SONIC_INPUTCAPTURE_PORT, BOARD_INITPINS_ULTRA_SONIC_INPUTCAPTURE_PIN, kPORT_MuxAlt3);

    PORTA->PCR[12] = ((PORTA->PCR[12] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullDown)

                      /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding
                       * pin. */
                      | PORT_PCR_PE(kPORT_PullDisable));

