theoliver7/hslu-pren2-team1/stair-climber-tinyK22/board/pin_mux.c
    /* PORTA13 (pin 29) is configured as PTA13 */
    PORT_SetPinMux(BOARD_INITPINS_GROUND_SENSOR_PORT, BOARD_INITPINS_GROUND_SENSOR_PIN, kPORT_MuxAsGpio);

    PORTA->PCR[13] = ((PORTA->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTA2 (pin 24) is configured as FTM0_CH7 */
    PORT_SetPinMux(BOARD_INITPINS_LIFTMOT2_DOWN_PORT, BOARD_INITPINS_LIFTMOT2_DOWN_PIN, kPORT_MuxAlt3);

    PORTA->PCR[2] = ((PORTA->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullDown)

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTA4 (pin 26) is configured as FTM0_CH1 */
    PORT_SetPinMux(BOARD_INITPINS_LIFTMOT1_UP_PORT, BOARD_INITPINS_LIFTMOT1_UP_PIN, kPORT_MuxAlt3);

    PORTA->PCR[4] = ((PORTA->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullDown)

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTA5 (pin 27) is configured as FTM0_CH2 */
    PORT_SetPinMux(BOARD_INITPINS_LIFTMOT1_DOWN_PORT, BOARD_INITPINS_LIFTMOT1_DOWN_PIN, kPORT_MuxAlt3);

    PORTA->PCR[5] = ((PORTA->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullDown)

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTB0 (pin 35) is configured as PTB0 */
    PORT_SetPinMux(BOARD_INITPINS_ULTRA_SONIC1_SEND_PORT, BOARD_INITPINS_ULTRA_SONIC1_SEND_PIN, kPORT_MuxAsGpio);

    /* PORTB1 (pin 36) is configured as PTB1 */
    PORT_SetPinMux(BOARD_INITPINS_ULTRA_SONIC2_SEND_PORT, BOARD_INITPINS_ULTRA_SONIC2_SEND_PIN, kPORT_MuxAsGpio);

    /* PORTB16 (pin 39) is configured as PTB16 */
    PORT_SetPinMux(BOARD_INITPINS_STEPMOT_MS1_PORT, BOARD_INITPINS_STEPMOT_MS1_PIN, kPORT_MuxAsGpio);

    /* PORTB17 (pin 40) is configured as PTB17 */
    PORT_SetPinMux(BOARD_INITPINS_STEPMOT_MS0_PORT, BOARD_INITPINS_STEPMOT_MS0_PIN, kPORT_MuxAsGpio);

    /* PORTB18 (pin 41) is configured as PTB18 */
    PORT_SetPinMux(BOARD_INITPINS_STEPMOT_EN_PORT, BOARD_INITPINS_STEPMOT_EN_PIN, kPORT_MuxAsGpio);

    /* PORTB19 (pin 42) is configured as FTM2_CH1 */
    PORT_SetPinMux(BOARD_INITPINS_STEPMOT_STEP_PORT, BOARD_INITPINS_STEPMOT_STEP_PIN, kPORT_MuxAlt3);

    /* PORTB2 (pin 37) is configured as PTB2 */
    PORT_SetPinMux(BOARD_INITPINS_STEPMOT_RESET_PORT, BOARD_INITPINS_STEPMOT_RESET_PIN, kPORT_MuxAsGpio);

    /* PORTB3 (pin 38) is configured as PTB3 */
    PORT_SetPinMux(BOARD_INITPINS_STEPMOT_MS2_PORT, BOARD_INITPINS_STEPMOT_MS2_PIN, kPORT_MuxAsGpio);

    /* PORTC10 (pin 55) is configured as FTM3_CH6 */
    PORT_SetPinMux(BOARD_INITPINS_MOT1_vorward_PORT, BOARD_INITPINS_MOT1_vorward_PIN, kPORT_MuxAlt3);

    /* PORTC11 (pin 56) is configured as FTM3_CH7 */
    PORT_SetPinMux(BOARD_INITPINS_MOT2_backwards_PORT, BOARD_INITPINS_MOT2_backwards_PIN, kPORT_MuxAlt3);

    /* PORTC8 (pin 53) is configured as PTC8 */
    PORT_SetPinMux(BOARD_INITPINS_STEPMOT_DIR_PORT, BOARD_INITPINS_STEPMOT_DIR_PIN, kPORT_MuxAsGpio);

    /* PORTC9 (pin 54) is configured as FTM3_CH5 */
    PORT_SetPinMux(BOARD_INITPINS_MOT1_backwards_PORT, BOARD_INITPINS_MOT1_backwards_PIN, kPORT_MuxAlt3);

    /* PORTD0 (pin 57) is configured as FTM3_CH0 */
    PORT_SetPinMux(BOARD_INITPINS_MOT2_vorward_PORT, BOARD_INITPINS_MOT2_vorward_PIN, kPORT_MuxAlt4);

    /* PORTD1 (pin 58) is configured as FTM3_CH1 */
    PORT_SetPinMux(BOARD_INITPINS_MOT3_backwards_PORT, BOARD_INITPINS_MOT3_backwards_PIN, kPORT_MuxAlt4);

    /* PORTD2 (pin 59) is configured as FTM3_CH2 */
    PORT_SetPinMux(BOARD_INITPINS_MOT3_vorward_PORT, BOARD_INITPINS_MOT3_vorward_PIN, kPORT_MuxAlt4);

    /* PORTD3 (pin 60) is configured as FTM3_CH3 */
    PORT_SetPinMux(BOARD_INITPINS_LED_RED_PORT, BOARD_INITPINS_LED_RED_PIN, kPORT_MuxAlt4);

    /* PORTD4 (pin 61) is configured as FTM0_CH4 */
    PORT_SetPinMux(BOARD_INITPINS_LED_GREEN_PORT, BOARD_INITPINS_LED_GREEN_PIN, kPORT_MuxAlt4);

    /* PORTD5 (pin 62) is configured as FTM0_CH5 */
    PORT_SetPinMux(BOARD_INITPINS_LED_BLUE_PORT, BOARD_INITPINS_LED_BLUE_PIN, kPORT_MuxAlt4);

    /* PORTD7 (pin 64) is configured as PTD7 */
    PORT_SetPinMux(BOARD_INITPINS_LEDBARRIER_RIGHT_PORT, BOARD_INITPINS_LEDBARRIER_RIGHT_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[7] = ((PORTD->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTE0 (pin 1) is configured as PTE0 */
    PORT_SetPinMux(BOARD_INITPINS_LEDBARRIER_LEFT_PORT, BOARD_INITPINS_LEDBARRIER_LEFT_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[0] = ((PORTE->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTE1 (pin 2) is configured as PTE1 */
    PORT_SetPinMux(BOARD_INITPINS_LEDBARRIER_STEPPER_PORT, BOARD_INITPINS_LEDBARRIER_STEPPER_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[1] = ((PORTE->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    SIM->SOPT4 = ((SIM->SOPT4 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT4_FTM1CH0SRC_MASK | SIM_SOPT4_FTM2CH1SRC_MASK)))

                  /* FTM1 channel 0 input capture source select: FTM1_CH0 signal. */
                  | SIM_SOPT4_FTM1CH0SRC(SOPT4_FTM1CH0SRC_FTM)

                  /* FTM2 channel 1 input capture source select: FTM2_CH1 signal. */
                  | SIM_SOPT4_FTM2CH1SRC(SOPT4_FTM2CH1SRC_FTM));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
